{
  "1": {
    "author": "M. Scott Peck, M.D.",
    "year": "1978",
    "title": "The Road Less Traveled",
    "description": "This book explores the importance of self-discipline, love, and spiritual growth, offering insights into personal development and the challenges of life."
  },
  "2": {
    "author": "Don Tapscott and Anthony D. Williams",
    "year": "2006",
    "title": "Wikinomics: How Mass Collaboration Changes Everything",
    "description": "This book explores how mass collaboration through the internet transforms business, society, and the economy, highlighting the power of collective intelligence and the impact of digital technologies."
  },
  "3": {
    "author": "Hemant Taneja with Kevin Maney",
    "year": "2021",
    "title": "Unscaled - How AI and a New Generation of Upstarts Are Creating the Economy of the Future",
    "description": "This book explores how AI and innovative startups are reshaping the economy, emphasizing the shift from traditional scaling to unscaled business models that leverage technology for efficiency and growth."
  },
  "4": {
    "author": "Petteri Kilpinen",
    "year": null,
    "title": "Inspiroitunut",
    "description": "This book explores leadership and success in a changing work environment, offering insights and strategies for navigating modern challenges."
  },
  "5": {
    "author": "Richard Carlson",
    "year": null,
    "title": "älä hikeenny raha-asioista",
    "description": "This book offers practical advice on managing financial stress and encourages readers to adopt a more relaxed approach to money matters, emphasizing the importance of peace of mind over financial worries."
  },
  "6": {
    "author": "Pekka A. Viljakainen, Mark Mueller-Eberstein",
    "year": null,
    "title": "No Fear",
    "description": "This book explores business leadership in the digital age, emphasizing innovative thinking and adaptability. It features insights from various contributors questioning traditional leadership paradigms."
  },
  "8": {
    "author": "William G. Dyer",
    "year": null,
    "title": "Team Building - Issues and Alternatives Second Edition",
    "description": "This book explores various aspects of team building, addressing common issues and presenting alternative strategies to enhance team effectiveness and collaboration."
  },
  "9": {
    "author": "Artiom Dashinsky",
    "year": null,
    "title": "Solving Product Design Exercises",
    "description": "This book provides practical exercises and insights to enhance product design and UX skills, helping readers prepare for job interviews in the field."
  },
  "10": {
    "author": "Sssi Kiviranta, Matias Maenpää, Petteri Poukka",
    "year": null,
    "title": "Exit vol 2",
    "description": "This volume features 16 inspiring true stories of Finnish entrepreneurs, showcasing their journeys and experiences in the business world."
  },
  "11": {
    "author": null,
    "year": null,
    "title": "toivo pekkanen runoilijana",
    "description": "This book explores the life and works of Toivo Pekkanen, a notable Finnish poet, highlighting his contributions to literature and the themes present in his poetry."
  },
  "12": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This book explores the venture capital landscape, focusing on the dynamics of investment and innovation in Silicon Valley, providing insights into the challenges and opportunities faced by entrepreneurs."
  },
  "13": {
    "author": "Sirkku Heinonen, Rea Klingberg, Päivi Pentti",
    "year": null,
    "title": "Kaikkien aivot käyttöön",
    "description": "This book explores strategies for enhancing cognitive abilities and utilizing brain power effectively in various contexts, aiming to improve learning and productivity."
  },
  "14": {
    "author": "Erin Meyer",
    "year": "2014",
    "title": "The Culture Map",
    "description": "This book explores how cultural differences impact global business interactions, providing insights on communication, leadership, and negotiation across various cultures."
  },
  "15": {
    "author": "Risto Havunen – Anna Lavikkala",
    "year": null,
    "title": "Ongelma ratkaiseva",
    "description": "This book focuses on problem-solving strategies for leaders, offering practical insights and tools to tackle challenges effectively in various organizational contexts."
  },
  "16": {
    "author": "Pekka A. Viljakainen, Mark Mueller-Eberstein",
    "year": null,
    "title": "No Fear",
    "description": "This book explores business leadership in the digital age, emphasizing the importance of adaptability and innovative thinking. It features insights from various contributors questioning traditional leadership paradigms."
  },
  "17": {
    "author": "Terho Puustinen & Mika Mäkeläinen",
    "year": null,
    "title": "taivas + helvetti",
    "description": "This book explores the journeys of entrepreneurs who faced significant challenges and losses but ultimately found success. It offers insights into resilience and the entrepreneurial spirit."
  },
  "18": {
    "author": "DON PEPPERS and MARTHA ROGERS, Ph.D.",
    "year": "1993",
    "title": "The One to One Manager",
    "description": "This book offers insights into customer relationship management, emphasizing personalized service and strategies to enhance customer loyalty and satisfaction."
  },
  "19": {
    "author": "Dr. Cristian Grossmann",
    "year": null,
    "title": "The Rise of the Frontline Worker",
    "description": "This book explores how organizations can leverage their frontline workforce to gain a competitive advantage, emphasizing the importance of empowering and engaging these essential workers."
  },
  "20": {
    "author": "Hemant Taneja & Stephen Klasko",
    "year": null,
    "title": "UnHealthcare: A Manifesto for Health Assurance",
    "description": "This book advocates for a transformative approach to healthcare, emphasizing health assurance over traditional healthcare models, aiming to improve outcomes and reduce costs."
  },
  "21": {
    "author": "Patrick Lencioni",
    "year": "2002",
    "title": "Viisi toimintahäiriötä tiimissä",
    "description": "This book explores five dysfunctions that hinder team performance, providing insights on how to overcome them to build a cohesive and effective team."
  },
  "22": {
    "author": "Paul Polman + Andrew Winston",
    "year": "2021",
    "title": "net positive",
    "description": "This book explores how companies can thrive by adopting a net positive approach, focusing on giving more to society and the environment than they take, ultimately leading to sustainable business practices."
  },
  "23": {
    "author": "Paul Polman + Andrew Winston",
    "year": "2021",
    "title": "net positive",
    "description": "This book explores how companies can thrive by adopting a net positive approach, emphasizing the importance of giving back to society and the environment while achieving business success."
  },
  "24": {
    "author": null,
    "year": null,
    "title": "notebook for great ideas or just random scribbles",
    "description": "A versatile notebook designed for jotting down ideas, sketches, or random thoughts. Perfect for anyone looking to capture inspiration on the go."
  },
  "25": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This novel explores the high-stakes world of venture capital and the personal and professional challenges faced by those navigating it, blending elements of suspense and drama."
  },
  "26": {
    "author": "Anneli Valpola",
    "year": null,
    "title": "Kehityskeskustelun mahdollisuudet",
    "description": "This book explores the possibilities of development discussions in various contexts, emphasizing the importance of effective communication and feedback in personal and professional growth."
  },
  "27": {
    "author": "Franklin Becker / Fritz Steele",
    "year": "1999",
    "title": "Workplace by Design",
    "description": "This book explores the relationship between workplace design and organizational performance, offering insights on creating high-performance work environments that enhance productivity and collaboration."
  },
  "28": {
    "author": "Linda Liukas",
    "year": "2015",
    "title": "Hello Ruby: Adventures in Coding",
    "description": "This whimsical book introduces children to the world of computers and programming through engaging stories and activities, making coding fun and accessible."
  },
  "29": {
    "author": "Linda Liukas",
    "year": "2015",
    "title": "Hello Ruby: Adventures in Coding",
    "description": "This book introduces children to the world of computers and programming through fun stories and activities, encouraging creativity and problem-solving skills."
  },
  "30": {
    "author": "Linda Liukas",
    "year": "2015",
    "title": "Hello Ruby: Adventures in Coding",
    "description": "This whimsical book introduces children to the world of computers and programming through engaging stories and activities, making coding fun and accessible."
  },
  "31": {
    "author": "Henry Chesbrough",
    "year": "2003",
    "title": "Open Innovation - The New Imperative for Creating and Profiting from Technology",
    "description": "This book introduces the concept of open innovation, emphasizing the importance of external ideas and collaboration in the innovation process to enhance technology development and profitability."
  },
  "32": {
    "author": null,
    "year": null,
    "title": "Start up guide berlin vol 2",
    "description": "This guide provides insights into Berlin's vibrant startup ecosystem, featuring resources, interviews, and tips for entrepreneurs looking to navigate the city's unique business landscape."
  },
  "33": {
    "author": "Scott Berkun",
    "year": null,
    "title": "Projektinhallinnan taito",
    "description": "This book offers practical insights into project management, emphasizing effective planning, execution, and leadership. It provides strategies for overcoming common challenges and improving team collaboration."
  },
  "34": {
    "author": "Alvy Ray Smith",
    "year": null,
    "title": "A Biography of the Pixel",
    "description": "This book explores the history and evolution of the pixel, detailing its significance in digital art and technology, as well as the author's experiences as a co-founder of Pixar."
  },
  "35": {
    "author": "Reid Hoffman, Chris Yeh",
    "year": "2018",
    "title": "Blitzscaling: The Lightning-Fast Path to Building Massively Valuable Companies",
    "description": "This book explores the concept of blitzscaling, a strategy for rapidly growing a company to achieve market dominance, emphasizing speed over efficiency in uncertain environments."
  },
  "36": {
    "author": "Karl Wahlin",
    "year": null,
    "title": "Tillämpad statistik",
    "description": "This book serves as an introductory course in applied statistics, covering fundamental concepts and methods used in statistical analysis."
  },
  "37": {
    "author": "Nils G Storhagen",
    "year": null,
    "title": "Logistik - grunder och möjligheter",
    "description": "This book provides foundational knowledge and insights into logistics, exploring its principles and opportunities within the field. It serves as a guide for understanding logistics management and its significance in various industries."
  },
  "38": {
    "author": "Alexander Osterwalder, Yves Pigneur",
    "year": "2010",
    "title": "Business Model Generation",
    "description": "This book provides a comprehensive guide to creating innovative business models. It introduces the Business Model Canvas, a strategic tool for visualizing and designing business models."
  },
  "39": {
    "author": "Jaakko Lindgren, Roope Mokka, Aleksi Neuvonen, Antti Toponen",
    "year": null,
    "title": "Digitalisaatio",
    "description": "This book explores the impact of digitalization on society, examining its challenges and opportunities. It provides insights into how digital transformation shapes various sectors and everyday life."
  },
  "40": {
    "author": "Don Tapscott and Alex Tapscott",
    "year": "2016",
    "title": "Blockchain Revolution",
    "description": "This book explores how blockchain technology is transforming money, business, and society, highlighting its potential to create a more secure and transparent world."
  },
  "41": {
    "author": "Walter Isaacson",
    "year": "2011",
    "title": "Steve Jobs",
    "description": "This biography explores the life and career of Steve Jobs, co-founder of Apple Inc., detailing his innovations, leadership style, and the impact he had on technology and design."
  },
  "42": {
    "author": "Alvy Ray Smith",
    "year": null,
    "title": "A Biography of the Pixel",
    "description": "This book explores the history and significance of the pixel in digital art and technology, highlighting its evolution and impact on modern visual culture."
  },
  "43": {
    "author": "Robert M. Grant",
    "year": "2010",
    "title": "Contemporary Strategy Analysis",
    "description": "This book provides a comprehensive overview of strategic management, integrating theory and practice. It emphasizes analytical tools and frameworks to help managers make informed decisions in a competitive environment."
  },
  "44": {
    "author": "General Stanley McChrystal, Jeff Eggers, Jason Mangone",
    "year": "2015",
    "title": "Leaders: Myth and Reality",
    "description": "This book explores the true nature of leadership, debunking common myths and providing insights from military and civilian leaders to illustrate effective leadership principles."
  },
  "45": {
    "author": "Leif Rylander",
    "year": null,
    "title": "the Winners take it all",
    "description": "This book explores how technology-based startups can transform inventions into successful innovations, emphasizing the strategies and mindsets necessary for success in the competitive landscape of entrepreneurship."
  },
  "46": {
    "author": "Pia Lappalainen, Markku Markkula, Hank Kune",
    "year": null,
    "title": "Orchestrating Regional Innovation Ecosystems",
    "description": "This book explores the dynamics of regional innovation ecosystems, focusing on collaborative strategies and frameworks that foster innovation and economic growth, particularly in the context of the Espoo Innovation Garden."
  },
  "47": {
    "author": "Timothy Ferriss",
    "year": "2017",
    "title": "Tribe of Mentors",
    "description": "A collection of life and business advice from successful individuals across various fields, offering insights and strategies to help readers navigate their own paths."
  },
  "48": {
    "author": "Greg Satell",
    "year": null,
    "title": "Cascades: How to Create a Movement That Drives Transformational Change",
    "description": "This book explores how to initiate and sustain large-scale change by creating movements that resonate with people, emphasizing the importance of storytelling and community engagement."
  },
  "49": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This novel explores the complexities of life and relationships against the backdrop of the Silicon Valley venture capital scene, blending personal struggles with the high-stakes world of startups."
  },
  "51": {
    "error": "Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o-mini in organization org-A44v2jFUQGfygOQtlWXw2CRu on tokens per min (TPM): Limit 200000, Used 200000, Requested 882. Please try again in 264ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}"
  },
  "52": {
    "author": "Nick Bilton",
    "year": "2013",
    "title": "Hatching Twitter",
    "description": "This book chronicles the tumultuous rise of Twitter, detailing the conflicts, friendships, and betrayals among its founders as they navigate the challenges of building a revolutionary social media platform."
  },
  "53": {
    "author": "Dave Gray, Sunni Brown, James Macanufo",
    "year": "2010",
    "title": "Game Storming - A Playbook for Innovators, Rulebreakers, and Changemakers",
    "description": "This book provides tools and techniques for creative collaboration, helping teams innovate and solve problems through engaging activities and visual thinking."
  },
  "54": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Kasvu-yrittäjän runokirja 1",
    "description": "A collection of poems aimed at entrepreneurs, blending inspiration and practical insights to foster growth and creativity in business."
  },
  "56": {
    "author": "Alex Osterwalder, Yves Pigneur, Greg Bernarda, Alan Smith",
    "year": "2014",
    "title": "Value Proposition Design",
    "description": "This book provides a framework for creating products and services that meet customer needs, helping businesses design compelling value propositions through practical tools and techniques."
  },
  "57": {
    "author": "Richard Branson",
    "year": "1998",
    "title": "Losing My Virginity: How I've Survived, Had Fun, and Made a Fortune Doing Business My Way",
    "description": "This autobiography chronicles Richard Branson's adventurous life as an entrepreneur, detailing his journey in building the Virgin Group and his philosophy on business and life."
  },
  "58": {
    "author": "Leonard Kim, Ryan Foland",
    "year": "2020",
    "title": "Ditch the Act - Reveal the Surprising Power of the Real You for Greater Success",
    "description": "This book encourages readers to embrace authenticity and vulnerability, highlighting how being genuine can lead to greater personal and professional success."
  },
  "59": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "A gripping narrative that explores the intersection of ambition, risk, and the dark side of the startup culture, set against the backdrop of Silicon Valley's infamous Sand Hill Road."
  },
  "60": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This book explores the venture capital landscape, focusing on the dynamics of funding startups and the challenges entrepreneurs face in Silicon Valley."
  },
  "61": {
    "author": "Eeva Eronen",
    "year": null,
    "title": "Jättiläisen askeleet matka kiinan talouteen",
    "description": "This book explores the complexities of China's economy, detailing its rapid growth and the challenges it faces. Eronen provides insights into the cultural and political factors influencing economic development."
  },
  "62": {
    "error": "Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o-mini in organization org-A44v2jFUQGfygOQtlWXw2CRu on tokens per min (TPM): Limit 200000, Used 200000, Requested 876. Please try again in 262ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}"
  },
  "63": {
    "author": "Margaret Heffernan",
    "year": "2021",
    "title": "Uncharted: How to Navigate the Future",
    "description": "This book explores how to navigate uncertainty and complexity in the modern world, emphasizing the importance of collaboration, adaptability, and understanding the unpredictable nature of the future."
  },
  "64": {
    "author": "John Brooks",
    "year": "1969",
    "title": "Business Adventures - Twelve Classic Tales from the World of Wall Street",
    "description": "This collection of twelve stories explores the ups and downs of the stock market, illustrating key events and personalities in Wall Street's history, making it a timeless read for business enthusiasts."
  },
  "65": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This novel explores the high-stakes world of venture capital and the personal and professional challenges faced by those navigating it, blending elements of suspense and drama."
  },
  "66": {
    "author": "Timo Ahopelto",
    "year": "2021",
    "title": "Sand Hill Road",
    "description": "This book explores the world of venture capital, detailing the challenges and strategies of startups seeking funding. It provides insights into the dynamics of Silicon Valley and the investment landscape."
  },
  "67": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This book explores the dynamics of venture capital and entrepreneurship, focusing on the challenges and opportunities in the startup ecosystem, particularly in Silicon Valley."
  },
  "68": {
    "author": "Benjamin Graham",
    "year": "1949",
    "title": "The Intelligent Investor",
    "description": "A foundational text on value investing, it emphasizes the importance of a disciplined approach to investing and offers strategies for minimizing risk while maximizing returns."
  },
  "69": {
    "author": "Petteri Kilpinen",
    "year": null,
    "title": "Inspiroitunut",
    "description": "This book explores leadership and success in a changing work environment, offering insights and strategies for navigating modern challenges."
  },
  "70": {
    "author": "Raija Rapo & Marita Seulamo-Vargas",
    "year": "2010",
    "title": "Silicon Valley Journey",
    "description": "This book explores the experiences of Finnish IT startups during the dot-com boom and their evolution up to 2010, highlighting challenges and successes in the dynamic landscape of Silicon Valley."
  },
  "71": {
    "author": null,
    "year": "2018",
    "title": "The Nordics Together - Uniting the Nordic Startup Ecosystem: Rising North Impact Fund 2016 - 2018",
    "description": "This book explores the collaboration within the Nordic startup ecosystem, highlighting the impact of the Rising North initiative from 2016 to 2018."
  },
  "72": {
    "error": "Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o-mini in organization org-A44v2jFUQGfygOQtlWXw2CRu on tokens per min (TPM): Limit 200000, Used 200000, Requested 897. Please try again in 269ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}"
  },
  "73": {
    "author": null,
    "year": null,
    "title": "The Nordics Together - Uniting the Nordic Startup Ecosystem: Rising North Impact Fund 2016 - 2018",
    "description": "This book explores the collaboration within the Nordic startup ecosystem, highlighting the initiatives and impact of the Rising North Impact Fund from 2016 to 2018."
  },
  "74": {
    "author": null,
    "year": null,
    "title": "The Nordics Together - Uniting the Nordic Startup Ecosystem: Rising North Impact Fund 2016 - 2018",
    "description": "This book explores the collaboration within the Nordic startup ecosystem, highlighting the initiatives and impact of the Rising North Impact Fund from 2016 to 2018."
  },
  "75": {
    "author": "Kardo Hämäläinen & Mika Mäkeläinen",
    "year": null,
    "title": "Taivas + helvetti vol.2",
    "description": "This book explores themes of success and failure, emphasizing the importance of collaboration and mutual support in achieving goals. It is a continuation of the insights presented in the first volume."
  },
  "76": {
    "author": "Karo Hämäläinen & Mika Mäkeläinen",
    "year": null,
    "title": "Taivas + helvetti vol.2",
    "description": "This book explores themes of success and failure, emphasizing the interconnectedness of individual journeys. It serves as a motivational guide, encouraging readers to reflect on their paths and the impact of their choices."
  },
  "77": {
    "author": "Karo Hämäläinen",
    "year": null,
    "title": "Yrittäjän taivas + helvetti vol 3",
    "description": "This book explores the highs and lows of entrepreneurship, offering insights and experiences that resonate with business owners. It combines personal stories with practical advice to inspire and motivate readers."
  },
  "78": {
    "author": "Daniel H. Pink",
    "year": "2018",
    "title": "When: The Scientific Secrets of Perfect Timing",
    "description": "This book explores the science of timing, revealing how the right timing can enhance productivity and well-being. Pink provides insights into daily rhythms and how to optimize our schedules for better outcomes."
  },
  "79": {
    "author": "James D. Stein, Herbert L. Stone, Charles V. Harlow",
    "year": null,
    "title": "Miten ampua lonkalta osumatta varpaisiinsa",
    "description": "This book focuses on making strategic decisions effectively and continuously, providing insights and techniques for better decision-making in business contexts."
  },
  "80": {
    "author": "Timothy Ferriss",
    "year": "2007",
    "title": "The 4-Hour Workweek",
    "description": "This book offers strategies to escape the 9-5 grind, automate income, and live a more fulfilling life. It encourages readers to rethink work and lifestyle, promoting the idea of mini-retirements and remote work."
  },
  "81": {
    "author": null,
    "year": "2020",
    "title": "Rise FinTech Insights",
    "description": "This publication offers insights into the fintech industry, showcasing trends, innovations, and key players. It serves as a resource for understanding the evolving landscape of financial technology."
  },
  "82": {
    "error": "Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o-mini in organization org-A44v2jFUQGfygOQtlWXw2CRu on tokens per min (TPM): Limit 200000, Used 200000, Requested 878. Please try again in 263ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}"
  },
  "83": {
    "author": "Yves Doz ja Mikko Kosonen",
    "year": null,
    "title": "Nopea strategia",
    "description": "This book explores how strategic agility helps organizations stay competitive in rapidly changing environments, offering insights and frameworks for effective strategic management."
  },
  "84": {
    "author": "Michael Blowfield, Alan Murray",
    "year": null,
    "title": "corporate responsibility a critical introduction",
    "description": "This book provides a comprehensive overview of corporate responsibility, exploring its significance, challenges, and implications for businesses and society. It critically examines various perspectives and practices in the field."
  },
  "85": {
    "author": null,
    "year": null,
    "title": "AVP storybook",
    "description": null
  },
  "86": {
    "author": "Miikka Leinonen",
    "year": null,
    "title": "Strategy of Giving",
    "description": "This book explores the principles and strategies behind effective giving, emphasizing the impact of generosity on personal and societal levels."
  },
  "87": {
    "author": "Leena Peltola",
    "year": null,
    "title": "Liikeideasta liikkeelle",
    "description": "This book focuses on transforming business ideas into actionable plans, providing insights and strategies for entrepreneurs to effectively launch and manage their ventures."
  },
  "88": {
    "author": "Anna Perho",
    "year": null,
    "title": "Pientä säätöä",
    "description": "A light-hearted guide to everyday life, offering practical tips and insights on managing daily challenges with humor and creativity."
  },
  "89": {
    "author": "Nir Eyal",
    "year": "2014",
    "title": "Hooked - How to Build Habit-Forming Products",
    "description": "This book explores the psychology behind why some products become habits. It provides a framework for creating engaging products that keep users coming back, focusing on triggers, actions, rewards, and investment."
  },
  "90": {
    "author": "Rob Fitzpatrick",
    "year": "2013",
    "title": "The Mom Test",
    "description": "This book teaches entrepreneurs how to effectively talk to customers and validate business ideas, ensuring they get honest feedback rather than polite lies."
  },
  "91": {
    "author": null,
    "year": "2012",
    "title": "AVP storybook",
    "description": "The AVP Storybook captures the essence of the AVP (Athlete Volunteer Program), showcasing inspiring stories and experiences of athletes involved in community service and volunteerism."
  },
  "92": {
    "author": "Juhani Talvela, Anne Hassinen, Marjut Honkasalo, Timo Nyberg",
    "year": null,
    "title": "Idea, Keskintö ja Maailmanvalloitus",
    "description": "This book explores the themes of innovation and global influence, celebrating 50 years of the Keksintösäätiö (Innovation Foundation) and its impact on technology and society."
  },
  "93": {
    "author": null,
    "year": "2001",
    "title": "Avauksia tietämyksen hallintaan",
    "description": "This book discusses the management of knowledge and technology assessment, providing insights into future-oriented evaluations and strategies."
  },
  "94": {
    "author": "Juhani Talvela, Anne Hassinen, Marjut Honkasalo, Timo Nyberg",
    "year": null,
    "title": "Idea, Keksintö ja Maailmanvalloitus",
    "description": "This book explores innovation and its impact on global development, celebrating 50 years of the Keksintösäätiö foundation and its contributions to technology and society."
  },
  "95": {
    "author": "Arianna Huffington",
    "year": "2014",
    "title": "Thrive",
    "description": "In 'Thrive', Arianna Huffington explores the importance of well-being and redefining success beyond money and power, emphasizing the need for a balanced life that includes wellness, wisdom, and wonder."
  },
  "96": {
    "author": "Timo Ahopelto",
    "year": null,
    "title": "Sand Hill Road",
    "description": "This novel explores the high-stakes world of venture capital and entrepreneurship, delving into the lives of those navigating the challenges and opportunities of Silicon Valley."
  },
  "97": {
    "author": "Cath Bishop",
    "year": "2022",
    "title": "The Long Win",
    "description": "This book explores the concept of success beyond traditional metrics, advocating for a more holistic approach to achievement that values long-term fulfillment and well-being."
  },
  "98": {
    "author": null,
    "year": null,
    "title": "Vesi - elämän lähde",
    "description": "This book explores the significance of water as a vital resource for life, highlighting its ecological importance and the need for conservation."
  },
  "99": {
    "author": null,
    "year": null,
    "title": "The Nordics Together - Uniting the Nordic Startup Ecosystem: Rising North Impact Fund 2016 - 2018",
    "description": "This book explores the collaboration within the Nordic startup ecosystem, highlighting initiatives and impacts of the Rising North Impact Fund from 2016 to 2018."
  },
  "100": {
    "author": null,
    "year": "1998",
    "title": "Uusmedia kuluttajan silmin",
    "description": "This book explores the impact of new media on consumer behavior, analyzing how digital media influences perceptions and interactions in the modern world."
  },
  "101": {
    "author": null,
    "year": "2019",
    "title": "Pelago Bicycles",
    "description": "This book showcases Pelago's bicycle designs, emphasizing craftsmanship, utility, and aesthetics. It reflects the brand's philosophy of creating functional and beautiful bicycles for urban cycling."
  },
  "102": {
    "author": "Jerry Colangelo",
    "year": "2001",
    "title": "How You Play the Game",
    "description": "This book offers insights and lessons from the sports industry, emphasizing the importance of integrity, teamwork, and leadership in both sports and life."
  },
  "103": {
    "author": null,
    "year": null,
    "title": "Boundless Design",
    "description": "This book explores the diverse perspectives of Finnish applied arts, showcasing innovative designs and cultural influences that shape the field."
  },
  "104": {
    "author": "Monika Jansson",
    "year": null,
    "title": "Rosenrött hav - Ruusunpunainen meri",
    "description": "This book serves as a diary of algae, exploring the beauty and diversity of marine life in the Baltic Sea, highlighting ecological insights and personal reflections."
  },
  "105": {
    "author": "Nathan Williams",
    "year": "2016",
    "title": "The Kinfolk Entrepreneur: Ideas for Meaningful Work",
    "description": "This book offers insights and inspiration for creating a fulfilling career, emphasizing the importance of meaningful work and community in entrepreneurship."
  },
  "106": {
    "author": null,
    "year": null,
    "title": "The Lean Way to Create",
    "description": "This book provides hands-on tools for designing and validating new business concepts, focusing on creating loveable services and future-capable organizations."
  },
  "107": {
    "author": null,
    "year": null,
    "title": "The Four Seasons of Korea",
    "description": "This book explores the beauty and cultural significance of Korea's four distinct seasons, showcasing the landscapes, traditions, and activities that characterize each time of year."
  },
  "108": {
    "author": "Philip Kotler, Gary Armstrong, Anders Parment",
    "year": null,
    "title": "Marknadsföring teori, strategi och praktik",
    "description": "This book covers fundamental marketing theories, strategies, and practical applications, providing insights into effective marketing practices and consumer behavior."
  },
  "109": {
    "author": null,
    "year": "2015",
    "title": "The Slush 100 Start-Ups",
    "description": "This book highlights 100 innovative start-ups selected by top European investors, showcasing emerging trends and entrepreneurial insights from the Slush conference."
  },
  "110": {
    "author": null,
    "year": "2022",
    "title": "Dispatch vol 3",
    "description": "This volume chronicles significant events and stories from the year 2022, providing insights and reflections on various topics and experiences."
  },
  "111": {
    "author": null,
    "year": "2022",
    "title": "Dispatch vol 3",
    "description": "This volume chronicles significant events and stories from the year 2022, providing insights and reflections on the challenges and triumphs experienced throughout the year."
  },
  "112": {
    "author": null,
    "year": null,
    "title": "The Nordics Together - Uniting the Nordic Startup Ecosystem: Rising North Impact Fund 2016 - 2018",
    "description": "This book explores the collaboration within the Nordic startup ecosystem, highlighting the initiatives and impact of the Rising North Impact Fund from 2016 to 2018."
  },
  "113": {
    "author": null,
    "year": null,
    "title": "Welcome to Finnish Design Thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing creativity, innovation, and user-centered design. It serves as a guide for integrating these concepts into various fields."
  },
  "114": {
    "author": null,
    "year": null,
    "title": "Welcome to Finnish Design Thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing innovation, user-centered design, and sustainability in creating impactful solutions."
  },
  "115": {
    "author": null,
    "year": null,
    "title": "Welcome to Finnish Design Thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing innovation, creativity, and user-centered design. It showcases how these concepts can be applied in various fields to enhance problem-solving and product development."
  },
  "116": {
    "author": "Jussi T. Koski",
    "year": null,
    "title": "Infoähky",
    "description": "This book discusses the challenges of information overload in learning and organizational contexts, providing insights for educators, leaders, and researchers on managing information effectively."
  },
  "117": {
    "author": "Lilya Lagerbohm",
    "year": null,
    "title": "Tunnista osaamisesi ja kirjoita täydellinen työhakemus",
    "description": "This workbook helps individuals identify their skills and write a comprehensive job application, enhancing their chances of securing employment."
  },
  "118": {
    "author": null,
    "year": null,
    "title": "welcome to finnish design thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing creativity, innovation, and user-centered design. It serves as a guide for integrating these concepts into various fields."
  },
  "119": {
    "author": null,
    "year": null,
    "title": "welcome to finnish design thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing creativity, innovation, and user-centered design. It serves as a guide for integrating these concepts into various fields."
  },
  "120": {
    "author": null,
    "year": null,
    "title": "welcome to finnish design thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing creativity, innovation, and user-centered design. It showcases various case studies and methodologies that highlight Finland's unique approach to design."
  },
  "121": {
    "author": null,
    "year": null,
    "title": "WELCOME TO FINNISH DESIGN THINKING",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing creativity, innovation, and user-centered design. It serves as a guide for integrating these concepts into various fields."
  },
  "122": {
    "author": null,
    "year": null,
    "title": "welcome to finnish design thinking",
    "description": "This book explores the principles and practices of Finnish design thinking, emphasizing creativity, innovation, and user-centered design. It serves as a guide for integrating these concepts into various fields."
  },
  "132": {
    "author": "The Lunicorn",
    "year": null,
    "title": "Startup Buzzword Dictionary",
    "description": "A humorous guide to the jargon and buzzwords commonly used in the startup world, helping readers navigate the often confusing language of entrepreneurship."
  }
}